In [1]:
import pandas as pd
import numpy as np
x = [1, 2, 3, 4, 5]
x = pd.Series(x) # Series 생성
x

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [2]:
x[2]

3

In [3]:
x = [1, 2, 3, 4, 5]
x = pd.Series(x)
x

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
x[0] # 1

1

In [5]:
x[1: 3] # 2, 3

1    2
2    3
dtype: int64

In [6]:
x[::-1] # 5, 4, 3, 2, 1

4    5
3    4
2    3
1    2
0    1
dtype: int64

In [7]:
x[x > 3] # 4, 5

3    4
4    5
dtype: int64

In [8]:
x + 1 # 2, 3, 4, 5, 6

0    2
1    3
2    4
3    5
4    6
dtype: int64

In [9]:
x * 10 # 10, 20, 30, 40, 50

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [10]:
x + x # 2, 4, 6, 8, 10

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [11]:
x = [1, 2, 3, 4, 5]
x = pd.Series(x, index=['a','b','c','d','e'])
x

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [12]:
x['a']

1

In [13]:
print(x['a']) # 명시적 인덱스접근
print(x[0]) # 묵시적 인덱스접근
print(x[['a','e']]) # 팬시색인, 한번에 여러값 접근
print(x.a) # 또다른 접근방법

1
1
a    1
e    5
dtype: int64
1

In [14]:
x = {"수학":90, "영어":80, "과학":95, "미술":80}
x = pd.Series(x)
x

수학    90
영어    80
과학    95
미술    80
dtype: int64

In [15]:
x = [1, None, 2, None, 3, 4, None]
x = pd.Series(x)
# 결측값을 무시하고 계산
print(x.sum()) # 10
print(x.max()) # 4
print(x.min()) # 1

10.0
4.0
1.0

In [16]:
#결측값 개수
print(x.isnull().sum()) # 3
print(x.notnull().sum()) # 4
#결측값 제거
x.dropna()
#결측값을 다른값으로 채우기
x.fillna(0)

3
4

0    1.0
1    0.0
2    2.0
3    0.0
4    3.0
5    4.0
6    0.0
dtype: float64

In [17]:
x = pd.Series([1, 2, 3])
y = pd.Series([4, 5, 6])
z = pd.Series([7, 8, 9])
pd.concat([x, y, z])

0    1
1    2
2    3
0    4
1    5
2    6
0    7
1    8
2    9
dtype: int64

In [18]:
# 같은인덱스번호가 있을경우 오류
# pd.concat([x, y, z], verify_integrity=True)
# 합치면서 인덱스 번호를 다시정리
pd.concat([x, y, z], ignore_index=True)
# 축변경
pd.concat([x, y, z], ignore_index=True, axis=1)
x = pd.Series([1, 2, 3, 4])
y = pd.Series([4, 5, 6])
z = pd.Series([7, 8, 9])
# 개수가 맞지 않을경우 교집합
pd.concat([x, y, z], ignore_index=True, axis=1, join='inner')

   0  1  2
0  1  4  7
1  2  5  8
2  3  6  9

In [19]:
# 개수가 맞지 않을경우 합집합
pd.concat([x, y, z], ignore_index=True, axis=1, join='outer')

   0    1    2
0  1  4.0  7.0
1  2  5.0  8.0
2  3  6.0  9.0
3  4  NaN  NaN

In [20]:
x = pd.Series([1, 2, 3, 4, 5])
y = pd.Series([6, 7, 8, 9, 0])

In [21]:
# 더하기
print(x.add(10))
print(x.add(y))
# 빼기
print(x.sub(y))
# 곱하기
print(x.mul(y))
# 나누기
print(x.floordiv(2))
print(x.div(2))
print(x.mod(2))
# 제곱
print(x.pow(2))

0    11
1    12
2    13
3    14
4    15
dtype: int64
0     7
1     9
2    11
3    13
4     5
dtype: int64
0   -5
1   -5
2   -5
3   -5
4    5
dtype: int64
0     6
1    14
2    24
3    36
4     0
dtype: int64
0    0
1    1
2    1
3    2
4    2
dtype: int64
0    0.5
1    1.0
2    1.5
3    2.0
4    2.5
dtype: float64
0    1
1    0
2    1
3    0
4    1
dtype: int64
0     1
1     4
2     9
3    16
4    25
dtype: int64

In [22]:
# 날짜 자동 생성
pd.date_range(start='2019-01-01', end='2019-01-07')

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [23]:
#기간 사용
pd.date_range(start='2019-01-01', periods=7)

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [24]:
#증감
pd.date_range(start='2019-01-01', periods=7, freq='2D')

DatetimeIndex(['2019-01-01', '2019-01-03', '2019-01-05', '2019-01-07',
               '2019-01-09', '2019-01-11', '2019-01-13'],
              dtype='datetime64[ns]', freq='2D')

In [25]:
pd.date_range(start='2019-01-01', periods=7, freq='W')

DatetimeIndex(['2019-01-06', '2019-01-13', '2019-01-20', '2019-01-27',
               '2019-02-03', '2019-02-10', '2019-02-17'],
              dtype='datetime64[ns]', freq='W-SUN')

In [26]:
#날짜형
x = pd.to_datetime(['2020-01-02 03:45', '2021-12-24 23:59'])
x.year

Int64Index([2020, 2021], dtype='int64')

In [27]:
x.weekday

Int64Index([3, 4], dtype='int64')

In [28]:
diff = x - pd.to_datetime('2020-02-12 15:39')
diff

TimedeltaIndex(['-42 days +12:06:00', '681 days 08:20:00'], dtype='timedelta64[ns]', freq=None)

## 실습 01

In [29]:
x = [np.nan, 1, 2, 3, 4, 5]
x = pd.Series(x)
y = pd.Series([x[np.random.randint(0, 6)] for i in range(20)])

In [30]:
# 1. 결측값의 개수 구하기
print("x 결측값의 개수: ", x.isnull().sum())
print("y 결측값의 개수: ", y.isnull().sum())

x 결측값의 개수:  1
y 결측값의 개수:  4

In [31]:
# 2. 결측값을 제거한 Series 만들기
x.dropna(inplace=True)
y.dropna(inplace=True)
print(x)
print(y)

1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
dtype: float64
2     2.0
3     4.0
4     4.0
5     3.0
6     4.0
7     5.0
8     1.0
9     2.0
10    3.0
12    5.0
13    4.0
14    1.0
15    4.0
16    5.0
17    3.0
18    5.0
dtype: float64

In [32]:
# 3. 결측값에 y의 평균값을 넣은 Series 만들기
x = [np.nan, 1, 2, 3, 4, 5]
x = pd.Series(x)
y = pd.Series([x[np.random.randint(0, 6)] for i in range(20)])
x.fillna(y.mean(), inplace=True)
y.fillna(y.mean(), inplace=True)
print(x)
print(y)

0    3.055556
1    1.000000
2    2.000000
3    3.000000
4    4.000000
5    5.000000
dtype: float64
0     1.000000
1     3.000000
2     3.055556
3     3.000000
4     5.000000
5     3.055556
6     1.000000
7     3.000000
8     2.000000
9     1.000000
10    5.000000
11    1.000000
12    4.000000
13    5.000000
14    4.000000
15    2.000000
16    5.000000
17    2.000000
18    3.000000
19    5.000000
dtype: float64

In [33]:
sales_data = {
'연도':[2015, 2016, 2017, 2018, 2019, 2020],
'판매량':[103, 70, 130, 160, 190, 230],
'매출':[500000, 300000, 400000, 550000, 700000, 680000],
'순이익':[370000, 190000, 300000, 480000, 600000, 590000]
}
df = pd.DataFrame(sales_data)
df

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000

In [34]:
df['판매량']

0    103
1     70
2    130
3    160
4    190
5    230
Name: 판매량, dtype: int64

In [35]:
df[['판매량', '매출']]

   판매량      매출
0  103  500000
1   70  300000
2  130  400000
3  160  550000
4  190  700000
5  230  680000

In [36]:
df[2:3]

     연도  판매량      매출     순이익
2  2017  130  400000  300000

In [37]:
df.iloc[1]

연도       2016
판매량        70
매출     300000
순이익    190000
Name: 1, dtype: int64

In [38]:
df.iloc[[1, 3]]

     연도  판매량      매출     순이익
1  2016   70  300000  190000
3  2018  160  550000  480000

In [39]:
a = pd.Series([103, 500000, 370000], ['판매량', '매출', '순이익'])
b = pd.Series([70, 300000, 190000], ['판매량', '매출', '순이익'])
c = pd.Series([130, 400000, 190000], ['판매량', '매출', '순이익'])
df = pd.DataFrame([a, b, c], index=[2015, 2016, 2017])
df

      판매량      매출     순이익
2015  103  500000  370000
2016   70  300000  190000
2017  130  400000  190000

In [40]:
df.iloc[1]

판매량        70
매출     300000
순이익    190000
Name: 2016, dtype: int64

In [41]:
df.iloc[[0, 2]]

      판매량      매출     순이익
2015  103  500000  370000
2017  130  400000  190000

In [42]:
df.loc[2015]

판매량       103
매출     500000
순이익    370000
Name: 2015, dtype: int64

In [43]:
df.loc[[2015, 2017]]

      판매량      매출     순이익
2015  103  500000  370000
2017  130  400000  190000

In [44]:
sales_data = {
'연도':[2015, 2016, 2017, 2018, 2019, 2020],
'판매량':[103, 70, 130, 160, 190, 230],
'매출':[500000, 300000, 400000, 550000, 700000, 680000],
'순이익':[370000, 190000, 300000, 480000, 600000, 590000]
}
sales_data = pd.DataFrame(sales_data, columns=['판매량','매출','순이익'], index=sales_data['연도'])
sales_data

      판매량      매출     순이익
2015  103  500000  370000
2016   70  300000  190000
2017  130  400000  300000
2018  160  550000  480000
2019  190  700000  600000
2020  230  680000  590000

In [45]:
df.loc[2015]

판매량       103
매출     500000
순이익    370000
Name: 2015, dtype: int64

In [46]:
df.loc[[2015, 2017]]

      판매량      매출     순이익
2015  103  500000  370000
2017  130  400000  190000

In [47]:
# 파일읽기
sales_data = pd.read_csv('sales_data.csv', index_col='연도', header=0, sep=',')
sales_data

      판매량      매출     순이익
연도
2015  103  500000  370000
2016   70  300000  190000
2017  130  400000  300000
2018   60  550000  480000
2019  190  700000  600000
2020  230  680000  590000

In [48]:
# 데이터 추가
sales_data = {
'연도':[2015, 2016, 2017, 2018, 2019, 2020],
'판매량':[103, 70, 130, 160, 190, 230],
'매출':[500000, 300000, 400000, 550000, 700000, 680000],
'순이익':[370000, 190000, 300000, 480000, 600000, 590000]
}
sales_data = pd.DataFrame(sales_data)
sales_data['순이익율'] = (sales_data['순이익']/sales_data['매출']) * 100

In [49]:
def check(n):
    if n > 80:
        return '높음'
    else:
        return '낮음'
sales_data['순이익율_비교'] = sales_data['순이익율'].apply(check)
sales_data

     연도  판매량      매출     순이익       순이익율 순이익율_비교
0  2015  103  500000  370000  74.000000      낮음
1  2016   70  300000  190000  63.333333      낮음
2  2017  130  400000  300000  75.000000      낮음
3  2018  160  550000  480000  87.272727      높음
4  2019  190  700000  600000  85.714286      높음
5  2020  230  680000  590000  86.764706      높음

In [50]:
# 인덱스에 조건가능
sales_data[sales_data['매출'] > 300000]

     연도  판매량      매출     순이익       순이익율 순이익율_비교
0  2015  103  500000  370000  74.000000      낮음
2  2017  130  400000  300000  75.000000      낮음
3  2018  160  550000  480000  87.272727      높음
4  2019  190  700000  600000  85.714286      높음
5  2020  230  680000  590000  86.764706      높음

In [51]:
# 해당 조건에 일치하는것만 데이터 변경 np.where(조건, True일경우, False일경우)
sales_data['테스트1'] = np.where(sales_data['판매량'] > 200, 0, sales_data['판매량'])
sales_data

     연도  판매량      매출     순이익       순이익율 순이익율_비교  테스트1
0  2015  103  500000  370000  74.000000      낮음   103
1  2016   70  300000  190000  63.333333      낮음    70
2  2017  130  400000  300000  75.000000      낮음   130
3  2018  160  550000  480000  87.272727      높음   160
4  2019  190  700000  600000  85.714286      높음   190
5  2020  230  680000  590000  86.764706      높음     0

In [52]:
# 해당 조건에 일치하는것만 바꾸고 나머지는 NaN
sales_data['테스트2'] = sales_data[sales_data['판매량'] < 100]['판매량'] + 50
sales_data

     연도  판매량      매출     순이익       순이익율 순이익율_비교  테스트1   테스트2
0  2015  103  500000  370000  74.000000      낮음   103    NaN
1  2016   70  300000  190000  63.333333      낮음    70  120.0
2  2017  130  400000  300000  75.000000      낮음   130    NaN
3  2018  160  550000  480000  87.272727      높음   160    NaN
4  2019  190  700000  600000  85.714286      높음   190    NaN
5  2020  230  680000  590000  86.764706      높음     0    NaN

In [53]:
# 행추가
sales_data = {
'연도':[2015, 2016, 2017, 2018, 2019, 2020],
'판매량':[103, 70, 130, 160, 190, 230],
'매출':[500000, 300000, 400000, 550000, 700000, 680000],
'순이익':[370000, 190000, 300000, 480000, 600000, 590000]
}
sales_data = pd.DataFrame(sales_data)
sales_data['순이익율'] = (sales_data['순이익']/sales_data['매출']) * 100
sales_data.loc[6] = [2021, 720000,650000, 360, 0]
sales_data.loc[7] = sales_data.loc[5] + 100
sales_data

       연도       판매량        매출       순이익        순이익율
0  2015.0     103.0  500000.0  370000.0   74.000000
1  2016.0      70.0  300000.0  190000.0   63.333333
2  2017.0     130.0  400000.0  300000.0   75.000000
3  2018.0     160.0  550000.0  480000.0   87.272727
4  2019.0     190.0  700000.0  600000.0   85.714286
5  2020.0     230.0  680000.0  590000.0   86.764706
6  2021.0  720000.0  650000.0     360.0    0.000000
7  2120.0     330.0  680100.0  590100.0  186.764706

In [54]:
sales_data1 = {
'연도':[2015, 2016, 2017, 2018],
'판매량':[103, 70, 130, 160],
'매출':[500000, 300000, 400000, 550000],
'순이익':[370000, 190000, 300000, 480000]
}
sales_data2 = {
'연도':[2019, 2020],
'판매량':[190, 230],
'매출':[700000, 680000],
'순이익':[ 600000, 590000]
}
sales_df = pd.DataFrame(sales_data1)
sales_df2 = pd.DataFrame(sales_data2)
# append
sales_df.append(sales_df2, ignore_index=True)
# concat
pd.concat([sales_df, sales_df2], ignore_index=True)

C:\Users\user\AppData\Local\Temp\ipykernel_8956\2317382017.py:16: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  sales_df.append(sales_df2, ignore_index=True)

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000

In [55]:
cost_data = {
'연도':[2015, 2016, 2017, 2018],
'이자':[1520, 1120, 1360, 1680],
'관리비':[650, 400, 750, 800],
'세금':[12000, 8900, 10900, 12800] }
cost_data = pd.DataFrame(cost_data)
# merge
pd.merge(sales_df, cost_data, on='연도', how='left')

     연도  판매량      매출     순이익    이자  관리비     세금
0  2015  103  500000  370000  1520  650  12000
1  2016   70  300000  190000  1120  400   8900
2  2017  130  400000  300000  1360  750  10900
3  2018  160  550000  480000  1680  800  12800

In [56]:
df = pd.DataFrame(np.random.randint(1, 100, size=(4, 4)), index=[['A','A','B','B'],['a','b','a','b']],
columns=[['가가','가가','나나','나나'],['가','나','가','나']])
df

     가가      나나
      가   나   가   나
A a   8  42  50  88
  b  19  77  73  59
B a  45  19  94  16
  b  12  41  21  28

In [57]:
df['가가']

      가   나
A a   8  42
  b  19  77
B a  45  19
  b  12  41

In [58]:
df.loc['A']

   가가      나나
    가   나   가   나
a   8  42  50  88
b  19  77  73  59

In [59]:
df = pd.DataFrame(np.random.randint(1, 100, size=(8, 2)),
index=[['A창고','A창고','A창고','A창고','B창고','B창고','B창고','B창고'],
['사과','배','바나나','사과','사과','배','바나나','배']],
columns=['판매','재고'])
df.index.names = ['창고명','상품명']

In [60]:
df.groupby('창고명').sum()

      판매   재고
창고명
A창고  159  129
B창고  232  150

In [61]:
df.groupby('상품명').sum()

      판매   재고
상품명
바나나   74   82
배    181  145
사과   136   52

In [62]:
df.groupby(['창고명','상품명']).sum()

          판매   재고
창고명 상품명
A창고 바나나   23   70
    배     45   10
    사과    91   49
B창고 바나나   51   12
    배    136  135
    사과    45    3

In [63]:
df = pd.DataFrame(np.random.randint(1, 100, size=(8, 2)),
index=[['A창고','A창고','A창고','A창고','B창고','B창고','B창고','B창고'],
['사과','배','바나나','사과','사과','배','바나나','배']],
columns=['판매','재고'])

In [64]:
df.sort_values(by="판매", ascending=True)

         판매  재고
B창고 사과   41  12
    배    41  25
    바나나  63   7
A창고 사과   75  69
    바나나  77  30
    사과   91  65
B창고 배    92  61
A창고 배    95  10

In [65]:
df.sort_values(by=["판매", "재고"],
ascending=[True, False])

         판매  재고
B창고 배    41  25
    사과   41  12
    바나나  63   7
A창고 사과   75  69
    바나나  77  30
    사과   91  65
B창고 배    92  61
A창고 배    95  10

## 실습 02

In [66]:
# 데이터 프레임 만들기
df = pd.DataFrame(np.random.randint(1, 100, size=(15, 3)),
index=[['1학년', '1학년', '1학년', '1학년', '1학년', '2학년', '2학년', '2학년', '2학년', '2학년', '3학년', '3학년', '3학년', '3학년', '3학년'],
['1반', '2반', '3반', '4반', '5반', '1반', '2반', '3반', '4반', '5반', '1반', '2반', '3반', '4반', '5반']],
columns=['국어','영어', '과학'])
df

        국어  영어  과학
1학년 1반  95  98  61
    2반  23  77  35
    3반  37  32  36
    4반  92  86  15
    5반  67  22  70
2학년 1반  66  91  23
    2반   7  55  67
    3반  35   6  77
    4반  76  64  15
    5반  79  38  28
3학년 1반  45  89  78
    2반  99   9  17
    3반  17  80  67
    4반  32  72  95
    5반  68  12  76

In [67]:
# 반별 합계와 평균 추가
df['총점'] = df['국어'] + df['영어'] + df['과학']
df['평균'] = df['총점'] / 3
df

        국어  영어  과학   총점         평균
1학년 1반  95  98  61  254  84.666667
    2반  23  77  35  135  45.000000
    3반  37  32  36  105  35.000000
    4반  92  86  15  193  64.333333
    5반  67  22  70  159  53.000000
2학년 1반  66  91  23  180  60.000000
    2반   7  55  67  129  43.000000
    3반  35   6  77  118  39.333333
    4반  76  64  15  155  51.666667
    5반  79  38  28  145  48.333333
3학년 1반  45  89  78  212  70.666667
    2반  99   9  17  125  41.666667
    3반  17  80  67  164  54.666667
    4반  32  72  95  199  66.333333
    5반  68  12  76  156  52.000000

In [68]:
# 인덱스명 추가하고, 학년별 합계 구하기
df.index.names = ['학년', '반']
df.groupby('학년').sum()

      국어   영어   과학   총점          평균
학년
1학년  314  315  217  846  282.000000
2학년  263  254  210  727  242.333333
3학년  261  262  333  856  285.333333

## 실습 03

In [69]:
df = pd.read_csv("titanic_train.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [70]:
# 1. 결측치 처리
df["Age"].fillna(df["Age"].mean(), inplace=True)
df["Cabin"].fillna("N", inplace=True)
df["Embarked"].fillna("N", inplace=True)

In [71]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [72]:
# 2. 성별 생존자 합
df.groupby("Sex")["Survived"].sum()

Sex
female    233
male      109
Name: Survived, dtype: int64

In [73]:
# 3. 클래스별 생존자 합
df.groupby("Pclass")["Survived"].sum()

Pclass
1    136
2     87
3    119
Name: Survived, dtype: int64

In [74]:
# 4. 각 세대별 생존자 합
def gen(age):
    if age // 10 == 0:
        return "유아"
    elif age // 10 == 1:
        return "10대"
    elif age // 10 == 2:
        return "20대"
    elif age // 10 == 3:
        return "30대"
    elif age // 10 == 4:
        return "40대"
    elif age // 10 == 5:
        return "50대"
    elif age // 10 == 6:
        return "60대"
    else:
        return "노인"
df["Age_Range"] = df["Age"].apply(gen)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_Range
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,N,S,20대
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,30대
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,N,S,20대
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,30대
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,N,S,30대

In [75]:
df.groupby("Age_Range")["Survived"].sum()

Age_Range
10대     41
20대    129
30대     73
40대     34
50대     20
60대      6
노인       1
유아      38
Name: Survived, dtype: int64

## 실습 04

In [76]:
# 1. 30대이면서 1등석에 탄사람의 수
len(df[df["Age_Range"] == "30대"][df["Pclass"] == 1])

C:\Users\user\AppData\Local\Temp\ipykernel_8956\1689767103.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  len(df[df["Age_Range"] == "30대"][df["Pclass"] == 1])

50

In [77]:
# 2. 클래스별 나이 평균
df.groupby("Pclass")["Age"].mean()

Pclass
1    37.048118
2    29.866958
3    26.403259
Name: Age, dtype: float64

In [78]:
# 3. 클래스와 성별에 따른 생존율
df.groupby(["Pclass", "Sex"])["Survived"].mean()

Pclass  Sex
1       female    0.968085
        male      0.368852
2       female    0.921053
        male      0.157407
3       female    0.500000
        male      0.135447
Name: Survived, dtype: float64

In [79]:
# 4. 나이대별로 생존율 구하기
df.groupby("Age_Range")["Survived"].mean()

Age_Range
10대    0.401961
20대    0.324937
30대    0.437126
40대    0.382022
50대    0.416667
60대    0.315789
노인     0.142857
유아     0.612903
Name: Survived, dtype: float64